In [1]:
from sklearn import linear_model
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('homeprices.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [4]:
import math
median_bedrooms = math.floor(df.bedrooms.median())
median_bedrooms

3

In [7]:
df.bedrooms = df.bedrooms.fillna(median_bedrooms)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [8]:
reg = linear_model.LinearRegression()
reg

LinearRegression()

In [9]:
reg.fit(df[['area','bedrooms','age']],df.price)

LinearRegression()

In [11]:
reg.coef_

array([   137.25, -26025.  ,  -6825.  ])

In [12]:
reg.intercept_

383724.9999999998

In [13]:
reg.predict([[3000,3,40]])

array([444400.])

In [21]:
reg.predict([[2500,4,5]])

array([588625.])

In [23]:
d = pd.read_csv('hr.csv')
d

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [24]:
d.experience = d.experience.fillna('zero')
d

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [27]:
import math
d.test_score = d.test_score.fillna(math.ceil(d.test_score.median()))
d

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [49]:
pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5580 sha256=c02d940515e3f7d0586af38f13d2b55a87ea69d782a8be1f108d3589a83dbff8
  Stored in directory: c:\users\saroj\appdata\local\pip\cache\wheels\21\1d\b2\768b65901d249c6eb2a8d9c30392506555a4e94055ba4e0aa0
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1
Note: you may need to restart the kernel to use updated packages.

In [59]:
from word2number import w2n
d.experience = d.experience.apply(w2n.word_to_num)
print(d)

ValueError: Type of input is not string! Please enter a valid number word (eg. 'two million twenty three thousand and forty nine')

In [61]:
reg = linear_model.LinearRegression()
reg.fit(d[['experience','test_score','interview_score']],d.salary)

LinearRegression()

In [60]:
d

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         8.0                7   72000
7          11         7.0                8   80000

In [62]:
reg.predict([[2,9,6]])

array([53205.96797671])

In [63]:
reg.predict([[12,10,10]])

array([92002.18340611])

In [64]:
reg.predict([[0,0,0]])

array([17737.26346434])